In [2]:
import pandas as pd

In [3]:
person = {"first": ["Rishab", "Rajas", "Sam"],
          "last": ["Raina", "Raina", "Sulek"],
          "email": ["rainaa0277@gmail.com", "rajasraut@yahoo.com", "samsulek01@gmail.com"]}

In [4]:
person_df = pd.DataFrame(person)
person_df

    first   last                 email
0  Rishab  Raina  rainaa0277@gmail.com
1   Rajas  Raina   rajasraut@yahoo.com
2     Sam  Sulek  samsulek01@gmail.com

### Updating columns

In [5]:
person_df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
## to rename all columns in dataframe
person_df.columns = ['first_name','last_name','email_address']

In [7]:
person_df

  first_name last_name         email_address
0     Rishab     Raina  rainaa0277@gmail.com
1      Rajas     Raina   rajasraut@yahoo.com
2        Sam     Sulek  samsulek01@gmail.com

In [ ]:
## to make all columns uppercase
person_df.columns = [col.upper() for col in person_df.columns]

In [10]:
person_df

  FIRST_NAME LAST_NAME         EMAIL_ADDRESS
0     Rishab     Raina  rainaa0277@gmail.com
1      Rajas     Raina   rajasraut@yahoo.com
2        Sam     Sulek  samsulek01@gmail.com

In [ ]:
## to add spaces from the column names
person_df.columns = [ col.replace('_', ' ') for col in person_df.columns]

In [12]:
person_df

  FIRST NAME LAST NAME         EMAIL ADDRESS
0     Rishab     Raina  rainaa0277@gmail.com
1      Rajas     Raina   rajasraut@yahoo.com
2        Sam     Sulek  samsulek01@gmail.com

In [13]:
## to remove spaces from the column names
person_df.columns = [ col.replace(' ','_') for col in person_df.columns]

In [14]:
person_df

  FIRST_NAME LAST_NAME         EMAIL_ADDRESS
0     Rishab     Raina  rainaa0277@gmail.com
1      Rajas     Raina   rajasraut@yahoo.com
2        Sam     Sulek  samsulek01@gmail.com

In [15]:
## to make all columns lowercase
person_df.columns = [col.lower() for col in person_df.columns]

In [16]:
person_df

  first_name last_name         email_address
0     Rishab     Raina  rainaa0277@gmail.com
1      Rajas     Raina   rajasraut@yahoo.com
2        Sam     Sulek  samsulek01@gmail.com

In [ ]:
## to rename only selected columns
person_df.rename(columns={"first_name":'first',"last_name": 'last',"email_address": 'email'}, inplace=True)

In [19]:
person_df

    first   last                 email
0  Rishab  Raina  rainaa0277@gmail.com
1   Rajas  Raina   rajasraut@yahoo.com
2     Sam  Sulek  samsulek01@gmail.com

### Updating rows

In [20]:
# to update rows we can use loc and iloc 

# to update all values of a given row
person_df.loc[1] = ['Rajas','Raut','rajasraut@email.com']

In [21]:
person_df

    first   last                 email
0  Rishab  Raina  rainaa0277@gmail.com
1   Rajas   Raut   rajasraut@email.com
2     Sam  Sulek  samsulek01@gmail.com

In [22]:
#to change selected values only of a given row
person_df.loc[1, ['last','email']] = ['Raina','rajasraut@yahoo.com']

In [23]:
person_df

    first   last                 email
0  Rishab  Raina  rainaa0277@gmail.com
1   Rajas  Raina   rajasraut@yahoo.com
2     Sam  Sulek  samsulek01@gmail.com

In [25]:
#lets change rishabs email only

person_df.loc[0, 'email'] = 'er.rishab.raina@gmail.com'

In [26]:
person_df

    first   last                      email
0  Rishab  Raina  er.rishab.raina@gmail.com
1   Rajas  Raina        rajasraut@yahoo.com
2     Sam  Sulek       samsulek01@gmail.com

In [28]:
person_df.loc[0:1, 'email'] = ['rainaa0277@gmail.com','rajasraina@yahoo.com']

In [29]:
person_df

    first   last                 email
0  Rishab  Raina  rainaa0277@gmail.com
1   Rajas  Raina  rajasraina@yahoo.com
2     Sam  Sulek  samsulek01@gmail.com

In [30]:
# for changing one value at a time and only works for scalar
person_df.at[1,'last'] = 'Raut'
person_df.at[1,'email'] = 'rajasraut@yahoo.com'

In [31]:
person_df

    first   last                 email
0  Rishab  Raina  rainaa0277@gmail.com
1   Rajas   Raut   rajasraut@yahoo.com
2     Sam  Sulek  samsulek01@gmail.com

In [35]:
#to update multiple values at once
person_df['email'] = person_df['email'].str.upper()

In [36]:
person_df

    first   last                 email
0  Rishab  Raina  RAINAA0277@GMAIL.COM
1   Rajas   Raut   RAJASRAUT@YAHOO.COM
2     Sam  Sulek  SAMSULEK01@GMAIL.COM

In [37]:
person_df['email'] = person_df['email'].str.lower()
person_df

    first   last                 email
0  Rishab  Raina  rainaa0277@gmail.com
1   Rajas   Raut   rajasraut@yahoo.com
2     Sam  Sulek  samsulek01@gmail.com

### Important 4 Methods

1. apply
2. map
3. applymap
4. replace